[
  {
    "id": 1,
    "role": "Research Paper Assistant",
    "company": "Sekolah Vokasi Universitas Gadjah Mada (SV UGM)",
    "type": "Contract",
    "typeColor": "bg-purple-500/20 text-purple-400 border-purple-500/30",
    "location": "Remote",
    "period": "May 2025 - November 2025",
    "duration": "7 months",
    "description": "Conducted theoretical research comparing YOLOv8 and Re-Detr models for rock detection and classification, extending findings from the Shale Shaker Cuttings Estimations project.",
    "detailedDescription": "As a contract researcher from my lecturer, I authored a research paper comparing the effectiveness of YOLOv8 and Re-Detr models in detecting and classifying rock cuttings, building on insights from my internship project. The research focused on theoretical model performance, analyzing metrics such as precision, recall, and computational efficiency for Oil and Gas applications.",
    "mainProjects": [
      {
        "name": "Comparative Analysis of YOLOv8 and Re-Detr for Rock Detection",
        "description": "Authored a research paper comparing YOLOv8 and Re-Detr models for rock detection and classification in shale shaker systems.",
        "impact": "Provided theoretical insights to guide model selection for future computer vision applications in drilling operations.",
        "technologies": [
          "Python",
          "PyTorch",
          "YOLOv8",
          "Re-Detr",
          "Jupyter"
        ]
      }
    ],
    "achievements": [
      "Authored a research paper comparing YOLOv8 and Re-Detr for rock detection",
      "Analyzed model performance metrics, achieving insights into trade-offs between accuracy and computational efficiency",
      "Contributed to theoretical advancements in computer vision for oil and gas",
      "Presented research findings to stakeholders, influencing future project directions",
      "Enhanced understanding of model optimization for real-world applications"
    ],
    "technologies": [
      "Python",
      "PyTorch",
      "YOLOv8",
      "Re-Detr"
    ],
    "teamSize": 3,
    "logo": "📃",
    "companyInfo": {
      "industry": "Oil and Gas Technology",
      "size": "100-500 employees",
      "website": "https://paramadataunit.com"
    },
    "skills": [
      "Computer Vision",
      "Deep Learning",
      "Research",
      "Model Comparison",
      "Technical Writing"
    ]
  },
  {
    "id": 2,
    "role": "Full Stack Machine Learning Engineer",
    "company": "PT Parama Data Unit",
    "type": "Remote",
    "typeColor": "bg-green-500/20 text-green-400 border-green-500/30",
    "location": "Yogyakarta, Indonesia",
    "period": "Jan 2025 - July 2025",
    "duration": "6 months",
    "description": "Developed a desktop application using Python for real-time monitoring and analysis for Oil and Gas Company, integrated with existing enterprise systems using WITS-Level-0 format protocols for data transmission. Ensured compatibility across Windows 7 to 11, addressing diverse OS kernel requirements.",
    "detailedDescription": "As a Full Stack Machine Learning Engineer, I designed and implemented a desktop application for real-time data processing and visualization, seamlessly integrated with PT Parama Data Unit's existing infrastructure. My work focused on ensuring cross-platform compatibility across Windows 7 to 11, optimizing performance for different kernel versions, and collaborating with cross-functional teams to deliver a robust solution.",
    "mainProjects": [
      {
        "name": "Desktop Monitoring Application",
        "description": "Built a Python-based desktop application for real-time data monitoring, integrated with company systems for seamless data flow.",
        "impact": "Enabled real-time insights for operational teams, improving decision-making efficiency.",
        "technologies": [
          "Python",
          "PyQt5",
          "Pandas",
          "NumPy",
          "WITS-Level-0"
        ]
      }
    ],
    "achievements": [
      "Developed a cross-platform desktop application compatible with Windows 7-11",
      "Achieve seamless integration with existing enterprise systems with WITS-Level-0 data exchange format, reducing data latency",
      "Optimized application performance across diverse OS kernels",
      "Collaborated with stakeholders to align application features with business needs",
      "Improved operational efficiency through real-time monitoring capabilities"
    ],
    "technologies": [
      "Python",
      "PyQt5",
      "Pandas",
      "NumPy"
    ],
    "teamSize": 10,
    "logo": "🏢",
    "companyInfo": {
      "industry": "Oil and Gas Technology",
      "size": "100-500 employees",
      "website": "https://paramadataunit.com"
    },
    "skills": [
      "Machine Learning",
      "Full Stack Development",
      "Desktop Application Development",
      "System Integration",
      "Cross-Platform Compatibility"
    ]
  },
  {
    "id": 3,
    "role": "Internship Machine Learning Engineer",
    "company": "PT Parama Data Unit",
    "type": "Internship",
    "typeColor": "bg-blue-500/20 text-blue-400 border-blue-500/30",
    "location": "Yogyakarta, Indonesia",
    "period": "September 2024 - January 2025",
    "duration": "5 months",
    "description": "Developed a computer vision system for shale shaker cuttings estimation in Oil and Gas Company, focusing on real-time rock detection and analysis to enhance drilling process efficiency.",
    "detailedDescription": "During my internship, I focused on building a computer vision system for the Shale Shaker Cuttings Estimations project, utilizing OpenCV and Python to detect and analyze rock cuttings in real-time from CCTV footage. The system provided actionable insights for drilling operations, improving efficiency and accuracy.",
    "mainProjects": [
      {
        "name": "Shale Shaker Cuttings Estimations",
        "description": "Developed a computer vision system to detect and analyze rock cuttings on shale shakers in real-time using CCTV footage.",
        "impact": "Achieved 85% detection accuracy, enhancing drilling operation efficiency.",
        "technologies": [
          "Python",
          "OpenCV",
          "NumPy",
          "Flask",
          "PostgreSQL",
          "Socket.IO"
        ]
      }
    ],
    "achievements": [
      "Built a real-time computer vision system with 85% detection accuracy",
      "Integrated system with existing monitoring platforms, improving operational workflows",
      "Developed visualizations for rock composition trends, aiding decision-making",
      "Collaborated with operational teams to align system features with field requirements",
      "Gained hands-on experience in applying computer vision in the oil and gas industry"
    ],
    "technologies": [
      "Python",
      "OpenCV",
      "NumPy",
      "Flask",
      "PostgreSQL",
      "Socket.IO"
    ],
    "teamSize": 9,
    "logo": "🏢",
    "companyInfo": {
      "industry": "Oil and Gas Technology",
      "size": "100-500 employees",
      "website": "https://paramadataunit.com"
    },
    "skills": [
      "Computer Vision",
      "Machine Learning",
      "Real-Time Systems",
      "Data Analysis",
      "System Integration"
    ]
  }
]